Reports/ЭффективностьСтратегий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЭффективностьСтратегий</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ФинансовыеРезультатыПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ФинансовыеРезультатыПоСделкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрибыльУбыток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтратегияСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииСделок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ЭффективностьСтратегий/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПросадкиПоСтратегиям = ПросадкиПоСтратегиям();
	
КонецПроцедуры


Функция ПросадкиПоСтратегиям()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФинансовыеРезультатыПоСделкам.Период КАК Период,
		|	ФинансовыеРезультатыПоСделкам.СтратегияСделки КАК СтратегияСделки,
		|	ФинансовыеРезультатыПоСделкам.ПрибыльУбыток КАК ПрибыльУбыток
		|ИЗ
		|	РегистрНакопления.ФинансовыеРезультатыПоСделкам КАК ФинансовыеРезультатыПоСделкам
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтратегияСделки,
		|	Период";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	ПросадкиПоСтратегиям = Новый ТаблицаЗначений;
	ПросадкиПоСтратегиям.Колонки.Добавить("СтратегияСделки", Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("СправочникСсылка.СтратегииСделок"))));
	ПросадкиПоСтратегиям.Колонки.Добавить("МаксимальнаяПросадка", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	
	Стратегия = Неопределено;
	НакопленныйРезультат = 0;
	МаксНакопленныйРезультат = 0;
	Просадка = 0;
	МаксимальнаяПросадка = 0;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СтратегияСделки <> Стратегия Тогда
			Если ЗначениеЗаполнено(Стратегия) Тогда
				НоваяСтрока = ПросадкиПоСтратегиям.Добавить();
				НоваяСтрока.СтратегияСделки = Стратегия;
				НоваяСтрока.МаксимальнаяПросадка = МаксимальнаяПросадка;
			КонецЕсли;
			Стратегия = Выборка.СтратегияСделки;
			НакопленныйРезультат = 0;
			МаксНакопленныйРезультат = 0;
			Просадка = 0;
			МаксимальнаяПросадка = 0;
		КонецЕсли;
		
		НакопленныйРезультат = НакопленныйРезультат + Выборка.ПрибыльУбыток;
		
		Если НакопленныйРезультат > МаксНакопленныйРезультат Тогда
			МаксНакопленныйРезультат = НакопленныйРезультат;
		КонецЕсли;
		
		Просадка = НакопленныйРезультат - МаксНакопленныйРезультат; // отрицательное число
		
		Если Просадка < МаксимальнаяПросадка Тогда
			МаксимальнаяПросадка = Просадка;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока = ПросадкиПоСтратегиям.Добавить();
	НоваяСтрока.СтратегияСделки = Стратегия;
	НоваяСтрока.МаксимальнаяПросадка = МаксимальнаяПросадка;
	
	Возврат ПросадкиПоСтратегиям;

КонецФункции // ПросадкиПоСтратегиям()
